#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include "Intro.h"

void wait_for_enter() {
    printf("\n게임을 시작하려면 Enter를 누르세요...");
    clear_input_buffer();
    getchar();  // ENTER 대기
}

void show_title() {
       system("clear");
    printf(" ____  ____   _    ____ _____    ____    _  _____ \n");
    printf("/ ___||  _ \\ / \\  / ___| ____|  / ___|  / \\|_   _|\n");
    printf("\\___ \\| |_) / _ \\| |   |  _|   | |     / _ \\ | |  \n");
    printf(" ___) |  __/ ___ \\ |___| |___  | |___ / ___ \\| |  \n");
    printf("|____/|_| /_/   \\_\\____|_____|  \\____/_/   \\_\\_|  \n\n");

    printf("당신은 우주 고양이와 함께 여행을 하다 어떤 미지의 행성에 불시착하게 되었습니다.\n");
    printf("불시착의 영향으로 UFO는 수리가 필요하게 되었습니다.\n");
    printf("우주선이 수리되는 동안 당신은 우주 고양이를 돌보며 생존해야 합니다.\n");
    printf("과연 UFO가 무사히 수리되고, 우주 고양이와 함께 다시 여행을 떠날 수 있을까요?\n\n");

    wait_for_enter();
    system("clear");  
}

void show_prologue() {
     system("clear"); // Linux/WSL, Windows는 cls

    printf("⠀⠀⣰⣶⣿⡿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⡰⠋⠡⠒⠘⡉⠂⠒⠀⠀\n");
    printf("⢠⣻⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠒⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣦⠅⠐⠉⡇⠀⠀⠀⠀\n");
    printf("⠈⡿⡷⡌⠛⠷⠶⠟⢋⣯⡗⠁⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠠⡄⠀⠀⠀⠀⠀⠀⡔⠃⡇⠃⠉⠛⠓⠀⠀⠀⠀⠀⠀ \n");
    printf("⠀⠈⠩⢿⣷⣦⣾⠿⠋⠀⠈⠁⠀⡀⠀⠀⠀⠀⡤⣤⢖⣔⡤⡠⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣸⡏⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀ \n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠁⣠⣊⣾⣿⠟⠿⠇⠏⠏⢍⡛⢽⡧⣄⠇⢄⠀⠀⢰⣟⡉⠹⢦⡋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⢨⣮⣟⠏⡠⣊⠳⣄⡴⠛⣀⠀⠀⠉⠉⠻⣺⠕⣇⣀⣙⣦⣧⡄⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⡰⣿⣿⠅⠀⠙⠎⠿⠁⠉⠀⠉⠁⠀⠇⠀⡀⠈⢯⣷⠟⠀⢀⣈⡉⠋⡄⢳⡀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠄⠀⠀⠀⠠⠁⡐⠀⢿⣿⣟⠀⠀⠁⠈⠀⠀⠀⠀⠀⠀⠀⠀⣇⠜⠀⣼⠃⢀⢸⠀⡠⠏⠀⠘⡝⣿⠏⠧⣁⢦⡄⣄⠶⣍⡅⠋\n");
    printf("⠀⠀⠀⠀⠀⡀⠀⠀⠃⠀⠀⣬⣿⣗⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠠⣬⠟⠁⠀⠀⢀⡤⣦⠀⣠⣞⢭⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠡⠀⠀⠀⠀⠀⢔⣼⣿⢯⠋⠀⠙⠿⣆⡄⡀⣀⡀⣠⣤⡲⠼⠂⠉⠀⠄⠀⡀⠀⠀⠈⠧⡼⣳⡗⣯⠋⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀\n");
    printf("⠀⠀⡀⠀⠀⡊⣎⣏⢐⠀⢀⣀⡀⠀⢂⠀⠀⠀⠀⠀⠀⠀⠀⠀⡂⠀⠈⠀⡇⠀⣥⣧⠝⢓⢵⠟⠙⠛⡅⠦⡳⣧⡄⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⢫⡷⡿⡷⡟⣧⣧⣁⡿⠀⢄⠒⠀⠀⠀⣠⠖⡆⡀⡀⢄⢂⣵⣧⣺⢯⣧⣾⠿⠃⠁⠀⠀⠀⠀⠈⠀⠌⠫⠯⠻⣓⢆⡄⠀⠀\n");
    printf("⡄⠀⠀⠀⠀⠉⣍⣿⣿⣷⣷⣿⣿⣿⣿⣯⣕⣧⣴⣬⣵⣶⣿⠟⠿⠻⢭⠯⠟⢃⠀⠀⠀⠀⠀⠀⠀⠀⠁⣤⠀⠀⠀⠀⠉⣉⠈⠏⠌⡛\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠉⠉⠉⢉⡙⣫⠿⢏⣟⠛⠞⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣟⠛⡇⠀⠀⠀⠀⠀⠀⠈⠀⢌\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠇⡛⣼⣍⠇⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠰⣶⠶⣶⣦⣴⡧⠁⠀⠻⠦⡤⣄⣀⡀⠀⠀⠀⠀\n");
    printf("⢀⡖⠈⠉⠙⡄⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠄⠂⣏⡿⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠈⢿⣧⠀⠀⠀⠀⠀⠁⠀⣀⡾⠏⠁⠀⠀⠀⠀\n");
    printf("⠁⠀⠀⠀⠀⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⢁⡿⠅⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⢐⣟⠀⣤⡿⣟⣧⣠⣿⡇⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠐⡅⠀⣀⠀⠀⠀⠀⠀⠀⠀⠁⠠⠬⡏⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⢰⣷⡟⠉⠀⠀⠀⠈⢯⡳⣇⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⡅⠜⠀⠀⠰⠀⠀⠀⠀⠀⠀⠀⢨⡲⠁⠀⠀⠀⠀⠀⠀⡆⠂⠃⢈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢶⣆⠀⠀\n");
    printf("⠀⠈⠀⠈⠁⠀⠅⠀⡊⠀⠀⠀⡶⡀⠀⠀⢬⠳⠀⠀⠀⠀⠀⣬⣿⣥⠄⠒⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠉⠉⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠑⠗⠆⠁⡘⢷⠋⠁⠐⣭⣷⣖⢦⡦⡾⠿⠄⠈⣷⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⢀⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⡤⡀⠀⠀⡇⠇⠀⡱⡒⠊⠙⣯⣯⠅⠀⠀⠀⠉⠏⢟⠿⠾⣭⡀⢀⠀⠀⠀⠀⠀⠀⠀⣽⣧⡳⣄⣀⣠⠴⠖⡷⠂\n");
    printf("⡠⢤⡀⠀⠀⠀⣀⡴⠃⠢⠕⠉⠀⠀⠀⣝⡟⠀⢀⡾⠛⢣⠞⠁⠀⣶⣶⠟⠋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⣀⣷⡧⠄⠀⠀⠀⢠⠏⠀⠀\n");
    printf("⡄⠄⠂⠁⠁⠒⠁⠀⠀⠀⠀⠀⠀⠀⠠⡟⡁⣴⣟⣟⡿⣯⡥⡭⣿⣆⡹⣟⡄⠀⠀⠀⠀⡀⠀⠀⣤⣞⣋⣁⠁⠀⠀⠀⠀⠀⠀⠙⢗⣄\n");
    printf("⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣞⡇⡆⠀⠁⠀⠀⠘⠫⠕⠁⠈⠙⠋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⣿⠃⢹⡟⠒⠢⠦⠦⠾\n");
    printf(" \n");

    printf("우주를 여행하려면 Enter를 누르세요...\n");
    clear_input_buffer();
    getchar ();
    system("clear");
    
    printf("게임 목표:\n");
    printf ("\n");
    printf("우주 고양이가 무사히 UFO를 고칠 수 있도록 돌봐주세요.\n");
    printf(" - 허기, 산소, 기분을 관리하며 고양이를 건강하게 키우세요.\n");
    printf(" - 선택지 1) 음식 2) 산소 3) 게임기 0) 종료\n");

    printf("\n게임 진행 방식:\n");
    printf ("\n");

    printf(" > 각 상태는 랜덤하게 감소합니다.\n");
    printf(" > 상태 수치가 낮으면 고양이가 위험해집니다.\n");
    printf(" > 허기는 음식, 산소는 산소통, 기분은 게임기를 이용해 회복할 수 있습니다.\n");
    printf(" > 생존에 필요한 아이템은 게임기를 통해 미니게임을 클리어 하면 얻을 수 있습니다.\n");
    printf(" > 우주선이 모두 수리가 될 때까지 고양이를 생존시켜야 합니다.\n\n");
    printf(" > 모든 수치가 25이하가 될 시 게임 오버입니다.\n");

       wait_for_enter();
        system("clear");
    
}

void clear_input_buffer() {
    int c;
    while ((c = getchar()) != '\n' && c != EOF) {}
}
